'''
Реализуйте класс EvenNumbers, который в конструкторе принимает целое число n
— количество чётных чисел для генерации. Итератор должен выдавать числа по
порядку, начиная с 0: 0, 2, 4, ..., 2*(n-1).
Тесты для примеров и проверки:
evens = EvenNumbers(5)
for num in evens:
print(num) # Должно вывести 0, 2, 4, 6, 8
'''